gcc -g p3final.c
 ./a.out
Enter any number:
4
4 number is not prime
 3
bash: 3: command not found
 ./a.out
Enter any number:
3
3 number is PRIME
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x846: file p3final.c, line 30.
(gdb) r
Starting program: /home/runner/Test2Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:30
30    n=input_number();
(gdb) s
input_number () at p3final.c:3
3   {
(gdb) n
5     printf("Enter any number:\n");
(gdb) n
Enter any number:
6     scanf("%d",&x );
(gdb) n
17
7     return x;
(gdb) n
8   }
(gdb) n
main () at p3final.c:31
31    x=is_prime(n);
(gdb) n
32    output(n,x);
(gdb) n
17 number is PRIME
33    return 0;
(gdb) n
34  }
(gdb) c
Continuing.
[Inferior 1 (process 2279) exited normally]
(gdb) 